'''Добрый день, предлагаем ЗиП дизеля 6ЧН21/21.
 
Агрегат маслопрокачивающий в сборе 0211.35.000 * уточнять = 125000 руб/шт.
Агрегат маслозакачивающий Б.0390-35-100-2-04 (24В или 380В) * 105000 руб/шт/7-10 дней
 
Болт шатунный  0210.13.006-2 * 2490 руб/шт (в наличии 9 шт)
Болт шатунный  0390.11.008-01 * 2200 руб/шт (в наличии 36 шт)
+ 4 болта - большие (без номера)
 
Болт 0251.19.055 * 900 руб/шт/около 10 дней
Бочата водяные * 390 руб/шт/7 дней
 
Вал коленчатый 6ЧН 21/21 (Н1) демонтаж с двигателя * 750000 руб/10 раб.дней
Вал привода ТНВД  0217.19.020 * 25900 руб/шт/7-10 дней
Вал распределительный 0210.17.010 * 115-130тр руб/шт/по срокам уточнять.
 
Вал 0210.19.003 * 24000 руб/шт/7-8 дней
Вал 0210.22.012-3 * 2900 руб/шт/7-8 дней
Вал насоса 0210.44.015 * 5900 руб/шт/10 дней
 
Вал-шестерня в сборе 0210.69.270 * 7900 руб/шт/7 дней
Вал-шестерня 0211.19.002 * 7900 руб/шт/7 дней
 
Вал кулачковый 961В.0616.23.009-5 * 44900 руб/шт/10 дней
 
Венец зубчатый 0211.09.032 * 37900 руб/шт (в наличии 2 шт)
Венец сопловой 1802.00.109 * 15500 руб/шт/10-14 дней
 
- Вилка (держатель форсунки) 0210.05.025-2 * 960 руб/шт/7-8 дней
- Винт нажимной 0110.05.017-2 * 750 руб/шт
- Винт регулировочный 0110.05.022-1-01 * 790 руб/шт
 
- Вкладыши шатуна 6ЧН 21/21 ШИРОКИЕ (пара) * 5900 руб/пара/в наличии (Н1 - 2 комплекта + Р1 - 2 комплекта)
Вкладыши шатунные 0213.11.040 (верх) - толщина 4,015 (-0,02)
Вкладыши шатунные 0213.11.050 (низ) - толщина 4,015 (-0,02)
- Вкладыши шатуна 6ЧН 21/21 УЗКИЕ (пара) * 8900 руб/пара/в наличии 1 комплект (Н1)
Вкладыши шатунные 0221.13.017 (верх) - толщина 4,015 (-0,02)
Вкладыши шатунные 0221.13.018 (низ) - толщина 4,015 (-0,02)
- Вкладыши коренные 6ЧН 21/21 (пара) * 4500 руб/пара/в наличии (Н1 - 1 комплект + Р1 - 1 комплект)
Вкладыши коренные 0210.04.100 (верх) - толщина 5,516 (-0,022)
Вкладыши коренные 0210.04.110 (низ) - толщина 5,516 (-0,022)
Вкладыши коренные 0210.04.150 (низ, с отверстием) - толщина 5,516 (-0,022) - не поставляется
 
Вкладыши коренные 0217.00.007 (верх) - толщина 5,016 (-0,022)
Вкладыши коренные 0217.00.008 (низ) - толщина 5,016 (-0,022)
Вкладыши коренные 0217.00.009 (низ. с отверстием) - толщина 5,016 (-0,022) - не поставляется
 
- Вкладыши коренные 6ДМ21 (8ДМ21) 0390-04-120-6/130-6 (пара) * 5900 руб/пара/в наличии 8 пар (Н1)
- Вкладыши шатуна 6ДМ21 (8ДМ21) 0390-11-080-7/090-7 (пара) * 5900 руб/пара/в наличии 9 пар (Н1)
 
- Втулка опорная распределительного вала 0210.04.018 * 9800 руб/шт/7-8 дней
- Втулка опорно-упорная распределительного вала 0210.04.017 * 9800 руб/шт/7-8 дней
 
Втулка ВГШ  0210.13.010-7 * 12500 руб/шт/7-8 дней
Втулка ВГШ   Б0390-11-520 * 12500 руб/шт (в наличии 6 шт)
Втулка НИЖНЕЙ головки шатуна 0210.13.014 * 450 руб/шт/7 дней
 
Втулка направляющая 0110.05.005 * 2000 руб/шт (в наличии 12 шт)
 
Втулка 0210.13.014 * 490 руб/шт/7 дней
 
Втулка коромысла малого 0210.05.009 * 1350 руб/шт/10 дней
Втулка коромысла большого 0110.05.102 * 1350 руб/шт/10 дней
 
Втулка рокера 0110.18.007 * 990 руб/шт/10 дней
Втулка рокера 0110.18.009 * 1500 руб/шт/10 дней
 
Втулка ролика 961В.0616.23.038-1 * 5900 руб/комплект (перечень ниже)
Ось ролика 961В. 0616.23.041-1 

Втулка ролика 961В.0616.23.038-1 

Ролик 961В.0616.23.039-1

Втулка уплотнительная 0217.44.005 * 1000 руб/шт (в наличии 20 шт)
Втулка 0210.44.018 * 450 руб/шт (в наличии 8 шт)
Втулка уплотнительная 0210.44.022-1 * 900 руб/шт/7 дней
Втулка 0217.80.002 * 590 руб/шт
Втулка 0210.80.106-2 * 590 руб/шт/7 дней
 
Втулка цилиндра в сборе 0210.04.002 * 59000 руб/шт (Беларусь) - сроки изготовления 2 месяца
Втулка цилиндра в сборе 0210.04.002 * 39000 руб/шт - в наличии 6 шт (Чистополь) - сроки изготовления 1,5-2 месяца
 
Втулка 1802.00.012 * 4500 руб/шт/7-10 дней
Втулка 1802.00.032 * 4500 руб/шт/7-10 дней
 
Гайка М27  0210.04.026 * 2900 руб/шт
Гайка М36  0210.04.025 * 2900 руб/шт (в наличии 7 шт)
Гайка 0210.05.055-1 * 350 руб/шт
Гайка 0210.44.016 * 450 руб/шт (в наличии 3 шт)
 
- Гидромуфта привода вентилятора 0210.46.000-2-04 * 139000 руб/шт/10 дней
 
- Клапан впускной 0210.05.060 * 2800 руб/шт (в наличии 6 шт)
- Клапан выпускной 0210.05.070 * 2800 руб/шт (в наличии 8 шт)
 
- Клапан нагнетательный 6ТН14.16.040.000 * 2960 руб/шт/в наличии 6 шт
- Клапан нагнетательный 961В.0616.23.040 * 2200 руб/шт/в наличии 3 шт
 
Клапан редукционный 0210.42.040 * 7900 руб/шт/10 дней
Клапан форкамерный в сборе 0291.05.190-4 * 11800 руб/шт/7-10 дней
 
Колесо компрессора 1802.00.101 * 18900 руб/шт/10 дней
 
Коллектор выхлопной 0217.85.00-1 (0210.85.000-4 ) * 210000 руб/шт/10 дней
 
Кольца пр-во Беларусь:
Кольцо поршневое 0330.11.021-4 (0210.12.003-4) * 1730 руб/шт/в наличии (с НДС)
Кольцо поршневое 0210.12.004-4 * 1590 руб/шт/в наличии (с НДС)
Кольцо поршневое 0330.11.019-4 (0210.12.002) * 1890 руб/шт/в наличии (с НДС)
Кольцо поршневое 0330.11.050сб * 2790 руб/шт/в наличии (с НДС)
 
Кольца пр-во Берислав:
Кольцо поршневое 0330.11.021-4 (0210.12.003-4) * 1100 руб/шт (в наличии)
Кольцо поршневое 0210.12.004-4 * 1100 руб/шт (в наличии)
Кольцо поршневое 0330.11.019-4 (0210.12.002) * 1100 руб/шт (в наличии)
Кольцо поршневое 0330.11.050сб * 1690 руб/шт (в наличии)
 
Кольца пр-во РФ (с хранения):
Кольцо поршневое 0330.11.021-4 (0210.12.003-4) * (в наличии 40 шт)
Кольцо поршневое 0210.12.004-4 * (в наличии 21 шт)
Кольцо поршневое 0330.11.019-4 (0210.12.002) * (в наличии 9 шт)
Кольцо поршневое 0330.11.050сб * (в наличии 4 шт - без экспандера)
 
Кольцо промежуточное зубчатое в сборе с осью РЗ.0110.04.030 * НЕТ (уточнять)
Кольцо 0211.00.036 * 3900 руб/шт/в наличии НЕТ
Кольцо (полукольцо) 0210.04.091 * 3900 руб/шт (комплект = 4 полукольца) - в наличии 2 шт
Кольцо 0210.09.028 * 3900 руб/шт/в наличии НЕТ
Кольцо антинагарное  2910.40.02 * 6900 руб/шт/10-14 дней
Кольцо антипригарное ГД 0291.04.002 * 14500 руб/шт/10 раб.дней
 
Корпус подшипника 1802.00.011 * 6450 руб/шт/7-10 дней
Корпус подшипника 1802.00.031 * 6450 руб/шт/7-10 дней
 
Коромысло малое 0210.05.100 (010) * 20500 руб/шт/7-10 дней
Коромысло большое 0210.05.110 (020) * 20500 руб/шт/7-10 дней
 
- Кран 0221.44.010 * 1200 руб/шт/10 дней
- Кран гидромуфты Р3.0110.46.060 * 5950 руб/шт/7-10 дней
- Кран индикаторный 0210.05.120-01 * 2500 руб/шт (в наличии НЕТ)
 
 
Крыльчатка водяного насоса 0217.44.002-3 * 8900 руб/шт/7-10 дней
Крыльчатка водяного насоса 0217.51.003-1 * 8900 руб/шт/7-10 дней
Крыльчатка водяного насоса 0210.51.016-4 * 5900 руб/шт/7 дней
 
- Крышка 0210.00.126 * 300 руб/шт/10 раб.дней
 
- Крышка цилиндра 0210.05.000 (клапана, пружины, коромысла) * 198000 руб/шт/10-14 дней
- Крышка цилиндра 0210.05.080-1 (клапана, пружины) * 169000 руб/шт/10-14 дней
- Крышка цилиндра 0217.05.000 (клапана, пружины, коромысла) * 198000 руб/шт/10-14 дней
- Крышка цилиндра 0217.05.080-1 (клапана, пружины) * 169000 руб/шт/10-14 дней 
Крышки в сборе (сборка производилась на заводе Маминых, все комплектующие новые, кроме корпуса). Завод все старые крышки скупает и из них сейчас делают новые, все меняют там, ставят новые комплектующие, корпус оставляют старый. Продают эти крышки как новые (чем они, по сути, и являются), но предупредить о корпусе считаем нужным.
 
- Магнит управления захлопкой  ЭТ54Б * 7900 руб/шт/7-8 дней
 
Манжета 1-32х52-1 * 60 руб/шт/7-10 дней
Манжета 0210.44.025 * 550 руб/шт/10 дней
Манжета графитовая 0210.44.027 * 1300 руб/шт (в наличии 3 шт)
Манжета 961В.0616.23.000-В 1 * 850 руб/шт
 
Механизм шатунный 0213.11.030 * 29000 руб/шт/10-15 дней
 
Муфта привода ТНВД 0251.19.150 * 37900 руб/шт/7-10 дней
Муфта эластичная 047-85-60-010 * 27900 руб/шт/10-14 дней
 
- Наконечник 0110.18.012 * 690 руб/шт
- Направляющая траверсы 0210.05.036 * 1450 руб/шт/7 дней
- Направляющая траверсы 0213.05.002 * 1450 руб/шт/7 дней
 
- Насос топливный судового исполнения ТН6.2121.161-02ОМ3 * 530000 руб/шт/10-15 дней
- Насос топливный 6ТН14-06 (судового исполнения) * 530000 руб/шт/10-15 дней
- Насос топливный 6ТН14.16.000.000.06 (тепловозное исполнение) * 475000 руб/шт/10-дней
- Насос топливный 961В.0616.23.000 * 129000 руб/шт (в наличии 2 шт)
 
Насос водяной 0225.00.000 * уточнять
Насос водяной 0210.44.000 (алюминий) * 51900 руб/шт (в наличии 2 шт)
Насос водяной 0210.51.000сб (алюминий) * 59000 руб/шт/7-10 дней
Насос водяной 0215.44.000 * 69000 руб/шт/10 дней (в наличии 1 шт)
Насос водяной 0215.51.000 * 69000 руб/шт/10 дней (в наличии 1 шт)
Насос водяной 0217.44.000 (чугун) * 49900 руб/шт (в наличии НЕТ)
Насос водяной 0217.51.000 (чугун)  * 39900 руб/шт (в наличии 2 шт)
Насос водяной 0221.51.000 * 59000 руб/шт/7 дней
 
- Насос масляный 0210.33.000-1  * 59000 руб/шт/7-10 дней
- Насос масляный 0217.33.000  * 59000 руб/шт (в наличии 1шт)
 
- Насос топливоподкачивающий 0210.22.000-1 * 39900 руб/шт (в наличии 2 шт)
- Насос топливоподкачивающий 0217.22.000 * 39900 руб/шт (в наличии 1 шт)
 
Ось коромысла малого 0210.05.012 * 1000 руб/шт (в наличии 6 штук)
Ось коромысла большого 0210.05.013 * 1000 руб/шт (в наличии 6 штук)
 
Ось ролика 961В.0616.23.041-1 * 1100 руб/шт (в наличии 6 штук)
Охладитель наддувочного воздуха 0227.83.000-1 * 245000 руб/шт/10-12 дней
 
Палец поршневой 0330-11-006-1 * 11500 руб/шт/7-8 дней
Палец поршневой 0330-11-003-1 * 11500 руб/шт/7-8 дней
Палец 0330.11.020-1 (к поршню 0360.11.020 -7) * 10900 руб/шт/10 дней
Палец 0210.12.005-1 (к поршню 0210.12.001-4) * 7500 руб/шт (в наличии 6 штук) (пр-во Берислав)
Палец (ось ролика) * 0390.18.014-6 * 690 руб/шт/10 дней
 
Пара плунжерная 6ТН14.16.030.000 * 12900 руб/шт/в наличии 6 штук.
Пара плунжерная 961В.0616.23.030 * 8900 руб/шт/в наличии 12 штук
 
Патрубок 0210.85.060 * 4500 руб/шт/10 дней
Патрубок переливной 0210.04.022-1 * 590 руб/шт (в наличии 24 шт)
 
Пластина 0251.19.058 * 890 руб/шт/7 дней
 
Подогреватель топлива ТГМ3.10.87.001 * 29900 руб/шт/10-15 дней
Подпятник 0213.05.003 * 600 руб/шт/7 дней
 
Ползун в сборе 6ТН14.16.020.000 * 7500 руб/шт
Ползун 961В.0616.23.035А-1 * 4950 руб/шт
Полумуфта пластинчатая на ТНВД - 0251.19.150 * 38900 руб/шт/10 дней
Полукольцо осевого разбега 0210.04.090 * 3200 руб/шт/7-8 дней
 
Поршень 0210.12.001-4 * 36900 руб/шт (в наличии 6 шт) (пр-во Берислав) = 11.810гр
Поршень 0210.12.001-4 * 46700 руб/шт (в наличии НЕТ) (с НДС, пр-во Мелитополь)
Поршень 0210.12.010-1 * 22900 руб/шт/10 дней
Поршень 0280.11.020 * 64900 руб/шт (в наличии НЕТ) (пр-во Берислав)
Поршень составной 0360.11.020-7 (тепловозное исполнение, с выточкой под клапана) * 59900 руб/шт (в наличии НЕТ) (пр-во Берислав)
Поршень составной 0360.11.020-8 (судовое исполнение, без выточки под клапана) * 59900 руб/шт (в наличии НЕТ) (пр-во Берислав)
 
Прибор 8-позиционный 4.01.06.000 * 49900 руб/шт/7-10 дней (сроки уточнять)
Приспособление для выемки форсунки 0210.99.500-1 * 4500 руб/шт/10дней
 
Привод датчика тахометра 0210.69.250-3 * 24900 руб/шт/10 дней
Привод датчика тахометра 0211.69.250 * 24900 руб/шт/10 дней
 
Пружина 0210.44.025 * 450 руб/шт (в наличии НЕТ)
Пружина плунжера 961В.0616.23.023 * 1100 руб/шт/10 дней
Пружина клапана  0210.05.008 * 1100 руб/шт/7 дней
Пружина клапана  0210.05.009 * 1100 руб/шт/7 дней
 
- Распылитель 0210.24.010.000-3 (8*0,35*145 или 8*0,38*145) * 3850 руб/шт/в наличии 26 шт
- Распылитель 96А-24-010-7 (8х0,40х140) * 1500 руб/шт/в наличии
 
Раструб 0217.51.002-1 * 8900 руб/шт/5-6 дней
 
Регулятор в сборе 10ВРН-50А * 120000 руб/шт (в наличии 1 шт)
Регулятор в сборе 11ВРН-50А * 149000 руб/шт/7 дней  
Регулятор в сборе 1ВРН-50А * 89000 руб/шт/5-6 дней
Регулятор ВРН-30 (0210.00.060)  = старая модификация  ВРН-50 (1ВРН-30, 10ВРН-30, 11ВРН-30)  
Регулятор ВРН (СА-25) * 116000 руб/шт/7-14 дней  
 
- Реле скорости РС-3 0211.00.000-2 с приводом * 28900 руб/шт/7-10 дней
- Реле скорости с приводом 0211.69.270-03 * 28900 руб/шт/7-10 дней
 
- Ремкомплект водяного насоса 0210.44.000 * 6900 руб/комплект/7 дней
- Ремкомплект регулятора 10ВРН50 * 5000 руб/комплект/в наличии 2 комплекта
 
- Рессора 0211.19.021 * 3300 руб/шт/7 дней
- Рессора 0390.19.160 * 3300 руб/шт/в наличии 3 штуки
 
- Ролик 961В.0616.23.039-1 * 2500 руб/шт/7 дней
- Ролик рокера 0210.18.005 * 490 руб/шт/10 дней
- Рокер в сборе 0210.18.010 * 9800 руб/шт (в наличии 1 шт)
 
- Седло впускного клапана 0217.05.002 * 2490 руб/шт (в наличии 8 шт)
- Седло выпускного клапана 0217.05.003 * 2490 руб/шт (в наличии 12 шт)
 
Стакан 0210.05.038-2 * 10900 руб/шт/7 дней
Стакан 0210.05.038-4 * 13900 руб/шт/7 дней
Стакан под форсунку 0210.05.050-3 * 8950 руб/шт/7-8 дней
Стакан форсунки с уплотнительными кольцами для крышки цилиндра 0280.05.001-1 * 9500 руб/шт/10 дней
Стартер СТ-721 * 26900 руб/шт/5-6 дней
Сухарь 0110.05.012-2 * 350 руб/пара/7 дней
 
- Тарелка пружины 0110.05.011-1 * 490 руб/шт/7 дней
- Терморегулятор РТП-32-2М-65-3 * 48900 руб/шт/10 раб.дней (с НДС)
 
- Топливопровод (трубки топливные) 0210.28.000 (комплект 6 прямых трубок) * 23900 руб/комплект (в наличии 1 шт)  
- Топливопровод 0210.28.010-3 * 3050 руб/шт

- Топливопровод 0210.28.020-3 * 3050 руб/шт

- Топливопровод 0210.28.030-3 * 3050 руб/шт

- Топливопровод 0210.28.040-3 * 3050 руб/шт

- Топливопровод 0210.28.050-3 * 3050 руб/шт

- Топливопровод 0210.28.060-3 * 3050 руб/шт

 

- Топливопровод (трубки топливные) 0217.28.000 (составные - 12 штук гнутые - с ППЗ) * 59000 руб/комплект  - пр-во ТУРБОБАЛТ - с НДС
- Топливопровод (трубки топливные) 0217.28.000 (составные - 12 штук гнутые) * 31900 руб/комплект (в наличии 5 кт)
- Топливопровод (трубки топливные) 0217.28.080-1 (комплект 6 коротких трубок) - часть от комплекта 0217.28.000
- Топливопровод (трубки топливные) 0221.28.000 (составные - 12 штук гнутые) * 31900 руб/комплект/10 дней
 
Траверса в сборе * 0213.05.040 * 3600 руб/шт/10 дней
Трубка пароотводная 0210.49.050 * 7500 руб/шт/7-8 дней
Трубка переливная 0210.85.049 * 1050 руб/шт/7 дней
 
Турбокомпрессор ТК18Н02 * 290000 руб/шт/10-15 дней
Турбокомпрессор ТК18В28 * 390000 руб/шт/10-15 дней
 
Тяга управления от ТНВД к регулятору * 11900 руб/шт
 
Уплотнение 1802.00.091 * 3650 руб/шт/7-10 дней
Уплотнение подшипника 1802.00.107 * 3650 руб/шт/7-10 дней
Упор масляных коромысел  0110.05.090 *  900 руб/шт/10 дней
- Упор 0110.18.005-1 * 1100 руб/шт
- Упор 0210.05.104-1 * 1100 руб/шт
 
Фильтр грубой очистки масла 0211.00.00-2 (без дисков сетчатых 155-14) * 9900 руб/комплект/10 дней
Фильтроэлемент (диски сетчатые 155-14) * 350 руб/шт/склад (в комплекте 33 штуки)
Фильтроэлемент топлива ЭТФ-4 * бумажные по 220 руб/шт/склад (миткалевые по 690 руб/шт/10 дней)
Фильтроэлемент масла Нарва 6-4 * 350 руб/шт/склад
 
- Форсунка 0101.24.000-2 * 13900 руб/шт (в наличии 12 шт)
- Форсунка 0210.24.000.000.2 * 14900 руб/шт (в наличии 6 шт)
- Форсунка 0333.24.000 * 16900 руб/шт/7-8 раб.дней
 
Шайба 0210.18.016  (регулировочные шайбы для рокеров) * 390 руб/штука/7 дней
Шайба 0210.18.021 (0210.18.022) * 750 руб/шт/10 дней
 
Шайба стопорная 0210.44.017 * 690 руб/шт (в наличии 3 шт)
Шайба 0210.44.021 * 190 руб/шт (в наличии 10 шт) - это к/м кольцо 30*35*1,5мм.
 
Шатун 0210.13.000-7 * 39900 руб/шт
Шатун 0210.13.010 * 49900 руб/шт
Шатун 0216.13.000-01 в сборе (с ВГШ и вкладышем) * 55000 руб/шт/7 дней
 
Шестерня 0217.22.001 * 5500 руб/шт
Шестерня 0210.22.011-2 * 5900 руб/шт/10 дней
Шестерня 0210.22.021-1 * 4500 руб/шт/10 дней
Шестерня привода ТНВД * 13500 руб/шт
 
- Шпилька 0210.05.058 * 1100 руб/шт/7 дней
- Шпилька стойки коромысла 0210.05.080-02 * 1200 руб/шт/7 дней
- Шпилька М27    0210.04.034 * 2950 руб/шт
- Шпилька М36    0210.04.023 * 2950 руб/шт - в наличии 9 шт 
- Шпилька М36    0210.04.007-5 * 2950 руб/шт
- Штанга 0110.18.030-01 (длинная, на газ.двигатель) * 5050 руб/шт/10 дней
- Штанга 0110.18.030-01 * 5050 руб/шт/10 дней
 
Электромагнит ЭТ-54 * 4500 руб/шт/10 дней
Эжектор 0210.89.020 * 29800 руб/шт/7-10 дней
 
ПРОКЛАДКИ / КОЛЬЦА УПЛОТНИТЕЛЬНЫЕ:
 
- Прокладки (паронитовые) комплект на дизель 6ЧН 21/21 (32 наименования, 77 шт) * 19800 руб/комплект (в наличии 1 к-т)
 
Прокладка уплотнения корпуса ФТОТ (паронит) * 450 руб/шт/10 дней
Кольцо уплотнительное 0211.00.036 * 2650 руб/шт
 
Прокладка Р3.0110.04.044 * 590 руб/шт/7 дней
Прокладка Р3.0110.04.046 * 490 руб/шт/7 дней
Прокладка 0210.04.044-02 * 690 руб/шт/7 дней
Прокладка 0210.04.046-1 * 690 руб/шт/7 дней
Прокладка 0210.04.051-1 * 490 руб/шт/7 дней
Прокладка 0210.04.056 * 490 руб/шт/7 дней
Прокладка 0210.04.083-1 * 490 руб/шт/7 дней
Прокладка под крышку цилиндра 0210.04.085 (медные) * 790 руб/шт (в наличии 11 шт)
Прокладка под крышку цилиндра 0217.04.085 (биметаллические) * 790 руб/шт (в наличии 5 шт)
Прокладка под крышку цилиндра 0280.04.085 (стальные) * 1500 руб/шт (в наличии 5 шт)
 
Прокладка 0210.05.014 (0210.85.004-02) * 300 руб/шт (в наличии 46 шт)
Прокладка коллектора 0210.05.034 (0210.05.150) * 690 руб/шт (в наличии около 40-50 шт)
Прокладка 0210.05.035 * 300 руб/шт (в наличии НЕТ)
Прокладка 0330.05.040 * 360 руб/шт (в наличии 16 шт)
 
Прокладка на люк крышки цилиндров 0210.05.046-01 * 450 руб/шт (в наличии около 20 шт - надо проверять)
Прокладка клапанной коробки 0210.05.048 * 450 руб/шт  (в наличии 18 шт)
 
Прокладка 0211.19.005 * 290 руб/шт/7-10 дней
 
Прокладка медная 0210.27.104-1 * 550 руб/шт/10 дней
Уплотнение штуцера форсунки 0210.28.011 * 120 руб/шт
Кольцо уплотнительное 0211.37.007 * 300 руб/шт
 
Уплотнение редукционного клапана 0210.42.009-01 * 300 руб/шт
Уплотнение редукционного клапана 0210.42.015-01 * 300 руб/шт
Прокладка 0210.44.005-1 * 330 руб/шт
Втулка уплотнения водяных насосов 0217.44.005 * 780 руб/шт
Кольцо 0210.49.039 * 650 руб/шт
 
Прокладка 0211.80.019 * 200 руб/шт (в наличии 6 шт)
Прокладка 0211.80.103-1 * 590 руб/шт/7 дней
Прокладка 0210.80.104-1 * 800 руб/шт (в наличии 33 шт)
Прокладка Р3.0110.83-034-01 * 490 руб/шт (в наличии 20 шт)
Прокладка 0210.85.004-02 (смотри 0210.05.014)
Прокладка 0210.85.007 * 2500 руб/шт
Прокладка 0210.85.014 * 180 руб/шт/7-10 дней
Прокладка соединения выхлопных коллекторов (асбостальной) 0210.85.019-2 * 1590 руб/шт (в наличии 24 шт)
Прокладка 0330.85.067 * 460 руб/шт (в наличии 15 шт)
Прокладка 0217.85.201 * 2650 руб/шт (в наличии 9 шт)
 
Прокладка медная 961В.0616.23.062 * 1000 руб/шт/7 дней
 
Кольцо уплотнительное 1802.00.105 * 690 руб/шт/7-10 дней
Кольцо уплотнительное 1812.06.105 * 690 руб/шт/7-10 дней
Кольцо уплотнительное 1815.06.105 * 690 руб/шт/7-10 дней
 
Медные кольца:
- Прокладка форсунки (медная) 0210.05.043-2 (14*20*2) * 100 руб/шт/в наличии
- Кольцо уплотнительное форсунки (медное) 0330.05.088-6 (18*26*2мм) * 150 руб/шт/7 дней
 
РТИ на двигатель (под заказ - около 2-3 недель)
- Кольцо уплотнения форсунки 0210.80.007 или 100-3515121 * 145 руб/шт
- Кольцо уплотнительное резиновое 030-035-33 (форсунки) Г66-18829-73 * 100 руб/шт (в наличии есть)
- Кольцо резиновое 0210.49.041 * 450 руб/шт
- Кольцо уплотнительное Д2-030107 ГОСТ-9833-73 (ф145х5) * 350 руб/шт
 
- Кольцо уплотнительное (уплотнение штока клапана) 0330-05-094 (А1-2262) (15х20х2,5) * 100 руб/шт (в наличии)
- Кольцо уплотнительное Р3.0110.19.016 (54х60х3) * 150 руб/шт (в наличии 42 шт)
- Кольцо 0210.04.021-1 (18х28х5) * 100 руб/шт (в наличии)
- Кольцо уплотнительное под гильзу 0210.04.037-1 (Ф228х5) * 250 руб/шт (в наличии)
- Кольцо 0210.05.021-1 * 100 руб/шт (в наличии 30 шт)
- Кольцо 0210.05.027-2 (48х54х3) * 100 руб/шт (в наличии около 30 шт)
- Кольцо 0210.13.015-1 (квадратное сечение 12х18х5) * 150 руб/шт (в наличии 30 шт)
- Кольцо 0210.18.002-1 (ф31х7) * 100 руб/шт (в наличии 20 шт)
- Кольцо 0210.22.001 (34х40х3)* 100 руб/шт (в наличии 16 шт)
- Амортизатор (звездочка) 0211.35.004 * 100 руб/шт/10 дней
- Кольцо 0211.37.007 (52х60х4)* 100 руб/шт (в наличии)
- Манжета 0211.39.004 * 250 руб/шт (в наличии НЕТ)
- Кольцо 0210.44.028 (квадратное сечение 24х32 - высота 5мм) * 290 руб/шт (в наличии около 20 шт)
- Кольцо 0210.80.107 (28х34х3) * 80 руб/шт (в наличии 10 шт)
- Кольцо 0210.83.041 (ф290х7) * 350 руб/шт (в наличии 10 шт)
- Кольцо уплотнения впускного коллектора 0390.84.022 или Б1.0390.84.022 (95х107х6) * 250 руб/шт (в наличии НЕТ)
___________________________________________
 
ИНСТРУМЕНТ:
 
- Ключ для откруч. индикаторных кранов раб. цилиндра * 2500 руб/шт
- Ключ для съема крыльчатки водяного насоса 0217.99.010 * 6500 руб/шт/7 дней
- Комплект для откручивания гаек рабочего цилиндра 0211.99.010 * 25900 руб/комплект/10 дней
- Комплект приспособлений для затяжки гаек крышки цилиндра 0211.99.010-03 * 25900 руб/комплект/10 дней
- Ключ-рукоятка для проворачивания коленвала 0217.99.030 * 7500 руб/шт
- Приспособление для сжатия клапанных пружин 0390.99.030 * 9000 руб/шт/7 дней
- Приспособление центровочное 0251.99.050  * 7500 руб/шт
- Ключ (для впускного коллектора) 0291.99.080 - НЕТ
- Приспособление  для установки и снятия поршневых колец 0390.99.080 * 9800 руб/шт (в наличии 4 шт)
- Приспособление для подъема поршня с шатуном 0217.99.100 * 9800 руб/шт (нового образца, на замену старого 0210.99.150-2) (в наличии 2 шт)
- Комплект приспособлений для монтажа и демонтажа шатунно-поршневой группы 0210.99.150-2 * 25900 руб/комплект/10 дней
- Комплект приспособлений 0211.99.150 * 9600 руб/комплект/7 дней
- Комплект приспособлений для выемки из опрессовки втулки цилиндра 0210.99.190 * 25900 руб/комплект (в наличии 1 штука - некомплект)
- Кольцо для опускания поршня с кольцами в цилиндр 0210.99.255 * 4900 руб/шт
- Приспособление для проверки и регулировки форсунок    0210.99.280-1  * 12000 руб/шт/7 дней
- Приспособление для притирки клапанов 0210.99.390-1 * уточнять
- Комплект приспособлений для снятия и установки шатунных болтов 0221.99.450  * 25900 руб/комплект (в наличии 1 штука)
- Приспособление для выемки форсунок Ф-14 мм 0210.99.500 * 9800 руб/шт (в наличии 1 шт)
- Приспособление для выемки форсунок Ф-18 мм 0217.99.500 * 9800 руб/шт
- Ключ торцевой; для индикаторов; 0210.99.570 * 2  * 1900 руб/шт/7 дней
- Головка ключа; для снятия и установки шатунных болтов 0210.99.710 * 2  * 7500 руб/шт/7 дней
- Головка ключа; для снятия и установки шатунных болтов 0210.99.716 * 2  * 2500 руб/шт/7 дней
- Приспособление для установки и сжатия пружин клапанов 0390-99-600-1 * 9800 руб/шт (в наличии 1 штука)
- Шарошка-зенкер (комплект 2шт + стержень) * 27900 руб/комплект (в наличии 2 шт)'''